# EnergyAnalysisConceptualModel Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
GroupTypeId..::..EnergyAnalysisConceptualModel Property
GroupTypeId Class See Also
---
"Energy Analytical Model"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisConceptualModel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisConceptualModel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisConceptualModel {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace